PicFix/pic_fix/app/controllers/albums_controller.rb

  def show
    begin
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]