PicFix/pic_fix/app/controllers/photos_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "albums".* FROM "albums" WHERE "albums"."user_id" = $1 AND "albums"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos"
---
  def index
    @user = User.find(params[:user_id])
    @album = @user.albums.find(params[:album_id])
    @photos = @album.photos.all