PicFix/pic_fix/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    begin
      @user = User.find(params[:id])